clear t; clear h;

t = 0 : 0.001 : 0.8;

for k = 1 : length(t)
    
    %h(k) = 1 + (-0.5001 + 1.2119i)*exp((-10.6733 + 4.4027i)*t(k)) + (-0.4999 - 1.2119i)*exp((-10.6733 - 4.4027i)*t(k));
    h(k) = 1 + 0.6946*exp(-22.9126*t(k)) - 1.6946*exp(-9.3919*t(k));
end

figure; plot(t, h, 'LineWidth', 2); grid on
title("Переходная характеристика h(t)");

% for k = 1 : length(t)
%     
%     h(k) = 1 - (0.499906 - 1.2119i)*exp((-10.67 + 4.4i)*t(k));
% end

% 
% w = 10^-2 : 0.001 : 10^3;
% 
% % w = 0 : 0.001 : 100;
% % w = 0 : 0.001 : 1000;
% 
% for i = 1 : length(w)
%     
%     logw(i) = log10(w(i));
%     
%     fi(i) = atan(30.03*w(i)) - pi/2 - atan(0.0309*w(i)) - atan(29.4119*w(i));
%     
%     %fi(i) = atan((32.3073*w(i)^2 + 0.0372) / (w(i)^3 + 1.0776*w(i)));
%     
%     %A(i) = sqrt((17763.2*w(i)^6+8.09*10^6*w(i)^4+19026.9*w(i)^2+11.1477) / ((w(i)^2)*(w(i)^4+455.693*w(i)^2+0.564816)^2 ));
%     
%     A(i) = sqrt((46302*w(i)^6+4.8428*10^7*w(i)^4+165102*w(i)^2+64.1202)/(w(i)^2*(w(i)^4+1043.68*w(i)^2+ 1.2473)^2 ));
%     
%     L(i) = 20*log10(A(i));
%     
%     %fi(i) = atan((21.3488*(w(i))^2 + 0.025) / ((w(i))^3 - 0.039*w(i)));
%     %fi(i) = atan(((-1681526.52*(w(i)^2) - 1973.16) / (590.9761*(w(i)^5) + 269303.7526*(w(i)^3) + 333.7929*w(i)))  /  ((-78764.4*(w(i)^2) + 3056.4) / (590.9761*(w(i)^4) + 269303.7526*(w(i)^2) + 333.7929)));
% end
% fi = fi*180/pi;
% 
% subplot(2,1,1); plot(logw, L); grid on;
% legend('L, дБ');
% xlabel('lg(\omega), рад/с');
% 
% subplot(2,1,2); plot(logw, fi); grid on;
% legend('\phi, \circ'); xlabel('lg(\omega), рад/с');
% axis([-2 3 -180 -45]);
% 
% plot(w, fi); grid on; %axis([0 1 -90 -88]);
% axis([0 10 -110 -100]);
% 
% figure; plot(w, A); grid on; axis([0 100 0 100]);

%clear all; close all; clc;
% w = -1000 : 0.001 : 1000;
% 
% for i = 1 : length(w)
%     
%     %u(i) = (-215.179*w(i)^2 - 231.879)/(w(i)^4 + 1043.68*w(i)^2 + 1.2473);
%     u(i) = (174.3*(-786.2*w(i)^2) + (-24.31*w(i)^3+27.15*w(i))*5231*w(i)) / ((-786.2*w(i)^2)^2 + (-24.31*w(i)^3+27.15*w(i))^2);
%     
%     v(i) = (-6951.85*w(i)^2 - 8.007)/(w(i)^5 + 1043.68*w(i)^3 + 1.2473*w(i));
% end
% 
% figure; plot(u, v); grid on;
% title('Годограф АФЧХ');
% xlabel('U'); ylabel('jV');
% axis([-1 4 -250 250]);


